package Shemajamebeli_2;

public class Shemosaxazi {
    public static int main(String[] args) {

        //1 sakitxi
        //ა) მონაცემებისა და მათზე გათვალისწინებული მოქმედებების გაერთიანება ე.წ ბიექტში

        //2 sakitxi
        //ა) ჭეშმარიტია

        //3 sakitxi
        //ა.

        //4 sakitxi
        // მეთოდის ხელწერა არის მეთოდის დაწერა,განლაგება რომელიც განსაზღვრავს ამ მეთოდის სახელს,პარამეტრების ტიპს,რაოდენობას.

        //5 sakitxi
        //გ) რაიმე კლასის ობიექტის ველების ინიციალიზაციაა

        //6 sakitxi
        // რეკურსია არის პრინციპი ან მეთოდი რომელიც რეკურსიულად შეიძლება გამოიძახოს თავისი თავი.

        //7 sakitxi
//        System.out.println(count(3));
//
//        public int count(int n){
//            if (n==0) {
//                return 0;
//            } else {
//                return n+ count(n-1);
//            }
//        }
//    }

        //8 sakitxi
        //OOP შედგება  ინკაპსულაციისგა, მემკვიდრეობა , პოლიპორფიზმი, აბსტრაქციიგან
        //ინკაპსულაცია - მონაცემების დამალვა private
        // მემკვიდრეობითობა - ერთი კლასი ხდება მეორე კლასის შვილობილი და გადმოაქვს მისი მეთოდები
        //პოლიმორფიზმი - შესაძლოა ობიექტს მივცეთ კლასის ორი სხვადასხვა სახელი რაც მეტ ფუნქციონალს მისცემს
        //აბსტრაქცია - მალავს ინფორმაციას და გამოტანა სესაძლოა @overide


        //9 sakitxi
        // ბ.

        //10 sakitxi
        // დ) final

        //11 sakitxi
        //overloading არის ერთი და იმავე სახელი როდესაც აქვთ რამდენიმე მეთოდს მაგრამ სრულიად სხვა პარამეტრების სიით ხოლო overriding ოდესაც მემკვიდრეობიდან  მმიღებულია მეთოდი და ხელახლა ვაკეთებს ქვეკალებში ანუ შვილობილში

        //12 sakitxi
        // interface რის აბსტრაქტული ტიპი რომელიც მუდმივ ველებს შეიცავს და დიდი ასოებით იწერება.. ხლო abstract შეიცავს აბსტრაცტულ მეთოდებს,მემკვიდრეობითად შეილება გამოვიყენოთ

        //14
        // b) 13












        return 0;
    }
}